app/views/movies/index.erb

SELECT "casts".* FROM "casts" INNER JOIN "casts_movies" ON "casts"."id" = "casts_movies"."cast_id" WHERE "casts_movies"."movie_id" = $1  [["movie_id", 319]]
---
                <% end %><br>
                <% movie.casts.each do |c| %>

SELECT "movies".* FROM "movies" WHERE (title ILIKE '%Dune%')
---
                <% if @current_user.present?%>
                    <% if @current_user.movies.include? movie %>