app/views/movies/show.html.erb

SELECT "casts".* FROM "casts" INNER JOIN "casts_movies" ON "casts"."id" = "casts_movies"."cast_id" WHERE "casts_movies"."movie_id" = $1  [["movie_id", 318]]
---
    <div class="cast_list">
        <% @movie.casts.each do |c|%>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 318]]
---

        <% @movie.reviews.each do |r|%>