app/views/directors/show.html.erb

    <hr>
        <% @director.movies.each do |d|%>
---
SELECT "movies".* FROM "movies" WHERE "movies"."director_id" = $1  [["director_id", 124]]