app/controllers/casts_controller.rb

  def show
    @cast = Cast.find params[:id]
---
SELECT  "casts".* FROM "casts" WHERE "casts"."id" = $1 LIMIT $2  [["id", 139], ["LIMIT", 1]]