app/controllers/directors_controller.rb

  def show

    @director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]