app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title ILIKE '%Dune%')
---
  def index

    @movies = Movie.search params[:search]

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 318], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 274], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find params[:id]
    @movie_cal = @movie.reviews.average(:rating)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 277], ["LIMIT", 1]]
---
  def watchlist
    movie = Movie.find params[:id]