app/controllers/reviews_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 319], ["LIMIT", 1]]
INSERT INTO "reviews" ("content", "user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "ffgrsrgsrg"], ["user_id", 19], ["movie_id", 319], ["created_at", "2022-02-01 03:13:36.206441"], ["updated_at", "2022-02-01 03:13:36.206441"]]
---
  def create

    @review = Review.new review_params
    movie = Movie.find params[:movie_id]
    @review.user_id = @current_user.id

    # check if the user already written the review
    if @current_user.reviews.include? movie
      # raise 'hell'
      redirect_to movie_show_path(params[:movie_id])
      flash[:error] = 'You have already written a review for this movie'
    else
      # raise 'hell'

      @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
  def edit

    @review = Review.find params[:id]

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
UPDATE "reviews" SET "content" = $1, "movie_id" = $2, "updated_at" = $3 WHERE "reviews"."id" = $4  [["content", "from hahaha"], ["movie_id", 53], ["updated_at", "2022-02-01 04:27:09.520814"], ["id", 53]]
---
  def update
    @review = Review.find params[:id]
    # if the logged in user is not the owner, redirect to login path
    if @review.user_id != @current_user.id
      redirect_to login_path
      return
    end #if statement

    @review.update edit_params

DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 50]]
---
  def destroy
    @review = Review.destroy params[:id]