app/views/casts/show.html.erb

SELECT "movies".* FROM "movies" INNER JOIN "casts_movies" ON "movies"."id" = "casts_movies"."movie_id" WHERE "casts_movies"."cast_id" = $1  [["cast_id", 246]]
---
    <hr>
    <% @cast.movies.each do |d|%>